# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
series_1 = pd.Series(np.random.randint(1, high = 4, size = 100, dtype = int))
series_2 =  pd.Series(np.random.randint(1, high = 3, size = 100, dtype = int)) 
series_3 =  pd.Series(np.random.randint(10000, high = 30000, size = 100, dtype = int)) 
print(series_1, series_2, series_3, sep ='\n___________________________________\n')

0     2
1     2
2     3
3     2
4     2
     ..
95    1
96    3
97    3
98    3
99    3
Length: 100, dtype: int32
___________________________________
0     1
1     1
2     1
3     1
4     1
     ..
95    2
96    2
97    1
98    1
99    1
Length: 100, dtype: int32
___________________________________
0     16331
1     28931
2     21768
3     16835
4     11899
      ...
95    24007
96    27628
97    14060
98    29245
99    21533
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
series_concat = pd.concat([series_1,series_2,series_3], axis = 1, join = 'outer')
print(type(series_concat))
series_concat

<class 'pandas.core.frame.DataFrame'>

    0  1      2
0   2  1  16331
1   2  1  28931
2   3  1  21768
3   2  1  16835
4   2  1  11899
.. .. ..    ...
95  1  2  24007
96  3  2  27628
97  3  1  14060
98  3  1  29245
99  3  1  21533

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
#.rename(columns = {original_name : new_name, original_name_2 : new_name_2}, inplace=True means it will not make a new obj)
series_concat.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace = True)
series_concat

    bedrs  bathrs  price_sqr_meter
0       2       1            16331
1       2       1            28931
2       3       1            21768
3       2       1            16835
4       2       1            11899
..    ...     ...              ...
95      1       2            24007
96      3       2            27628
97      3       1            14060
98      3       1            29245
99      3       1            21533

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [23]:
#to_frame() takes a Series and converts it to a dataframe
bigcolumn = pd.concat([series_1,series_2,series_3], axis = 0).to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       2
2       3
3       2
4       2
..    ...
95  24007
96  27628
97  14060
98  29245
99  21533

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [15]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [26]:
#drop resets the index to default integer index and removes the original row
bigcolumn.reset_index(drop = True)
bigcolumn

         0
0        2
1        2
2        3
3        2
4        2
..     ...
295  24007
296  27628
297  14060
298  29245
299  21533

[300 rows x 1 columns]